glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM320_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>AnalogDevices</vendor>
   <name>ADuCM320_DFP</name>
   <description>Analog Devices ADuCM320 Device Support and Examples</description>
   <url>http://www.analog.com/media/en/engineering-tools/design-tools</url>
   <supportContact>http://www.analog.com/en/content/technical_support_page/fca.html</supportContact>
   <license>License\License.txt</license>  

   <releases>
      <release version="1.1.0">
      Added ADuCM320i device
      Added ADuCM322 device
      Changed folder structure
      Added ADuCM322 low level peripheral libraries
      </release>
      <release version="1.0.3">
      Fixed errors due to new ADI website
      Added low level peripheral libraries
      Updated device header file and SVD
      </release>
      <release version="1.0.1">
      Made pack compliant to Pack schema 1.3 
      Added RTX example
      Fixed Flashloader Sector Erase
      </release>
      <release version="1.0.0">
      Initial Release
      </release>
   </releases>

   <keywords>
      <!-- keywords for indexing -->
      <keyword>Analog Devices</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Analog Devices</keyword>
      <keyword>ADuCM320</keyword>
   </keywords>
   <devices>
      <family Dfamily="ADuCM32x Series" Dvendor="Analog Devices:1">

      <!-- ******************************  ADuCM320  ****************************** -->
      <device Dname="ADuCM320">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <book    name="Documentation\DUI0552A_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>

        <debug      svd="SVD\ADuCM320.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="1"   default="1"/>
        <algorithm  name="Flash\ADUCM320.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x20000000"  RAMsize="0x0800"  default="1"/>
        <book    name="Documentation\ADuCM320\User Guide\UG-498.pdf"          title="ADuCM320 Hardware Reference Manual"/>
        <book    name="Documentation\ADuCM320\Datasheet\ADuCM320.pdf"                   title="ADuCM320 Data Sheet"/>
        <book    name="Documentation\Technotes\AN-1310.pdf"         title="ADuCM320 Flash Programming via MDIO"/>
        <book    name="Documentation\Technotes\AN-1322.pdf"         title="ADuCM320 Code Execution Speed"/>
        <description>
The ADuCM320 is a Precision Analog Microcontroller, 14-Bit Analog I/O with MDIO interface, ARM Cortex M3
Typical applications include Optical networking – 10G, 40G and 100G modules, Industrial control and automation systems,
Smart sensors, precision instrumentation and Base station systems.
        </description>
        <feature type="ADC"           n="16"      m="14"    name="Multichannel, 14-bit 1MSPS ADC"/>
        <feature type="DAC"           n="8"       m="12"/>
        <feature type="AnalogOther"   n="4"       name="0 mA to 150 mA IDACs"/>
        <feature type="Other"         n="1"       name="MDIO slave up to 4 MHz"/>
        <feature type="PLL"           n="1"       name="80 MHz PLL with programmable divider"/>
        <feature type="IntRC"         n="16000000" m="16000000"      name="Internal oscillator with +/-3% accuracy"/>
        <feature type="XTAL"          n="16000000" m="16000000"      name="External Crystal Oscillator"/>
        <feature type="Memory"        n="262144"  name="256kB Flash memory"/>
        <feature type="Memory"        n="32768"   name="8kB SRAM"/>
        <feature type="SPI"           n="2"       m="40000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="PWM"           n="6"       m="16"/>
        <feature type="UART"          n="1"       m="500000"/>
        <feature type="IOs"           n="40"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="WDT"           n="1"       name="16 bit Watchdog timer"/>
        <feature type="TimerOther"    n="1"       name="32 bit Wake-up timer"/>
        <feature type="DMA"           n="14"     />        
        <feature type="NVIC"          n="54"     />        
        <feature type="TempSens"      n="1"     />        
        <feature type="Temp"          n="-40"     m="80"/>
        <feature type="VCC"           n="2.9"    m="3.60"/>
        <feature type="BGA"           n="96"/>
        <compile header="ADuCM320\common\ADuCM320.h"  define="ADuCM320"/>
      </device>
      <device Dname="ADuCM320i">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <book    name="Documentation\DUI0552A_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>

        <debug      svd="SVD\ADuCM320i.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="1"   default="1"/>
        <algorithm  name="Flash\ADUCM320.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x20000000"  RAMsize="0x0800"  default="1"/>
        <book    name="Documentation\ADuCM320i\User Guide\UG-868.pdf"          title="ADuCM320i Hardware Reference Manual"/>
        <book    name="Documentation\ADuCM320i\Datasheet\ADuCM320i.pdf"                   title="ADuCM320i Data Sheet"/>
        <book    name="Documentation\Technotes\AN-806.pdf"          title="Flash Programming via I2C—Protocol Type 5"/>
        <book    name="Documentation\Technotes\AN-1322.pdf"         title="ADuCM320 Code Execution Speed"/>
        <description>
The ADuCM320i is a Precision Analog Microcontroller, 14-Bit Analog I/O with MDIO interface, ARM Cortex M3
Typical applications include Optical networking – 10G, 40G and 100G modules, Industrial control and automation systems,
Smart sensors, precision instrumentation and Base station systems.
        </description>
        <feature type="ADC"           n="16"      m="14"    name="Multichannel, 14-bit 1MSPS ADC"/>
        <feature type="DAC"           n="8"       m="12"/>
        <feature type="AnalogOther"   n="4"       name="0 mA to 150 mA IDACs"/>
        <feature type="Other"         n="1"       name="MDIO slave up to 4 MHz"/>
        <feature type="PLL"           n="1"       name="80 MHz PLL with programmable divider"/>
        <feature type="IntRC"         n="16000000" m="16000000"      name="Internal oscillator with +/-3% accuracy"/>
        <feature type="XTAL"          n="16000000" m="16000000"      name="External Crystal Oscillator"/>
        <feature type="Memory"        n="262144"  name="256kB Flash memory"/>
        <feature type="Memory"        n="32768"   name="8kB SRAM"/>
        <feature type="SPI"           n="2"       m="40000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="PWM"           n="6"       m="16"/>
        <feature type="UART"          n="1"       m="500000"/>
        <feature type="IOs"           n="40"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="WDT"           n="1"       name="16 bit Watchdog timer"/>
        <feature type="TimerOther"    n="1"       name="32 bit Wake-up timer"/>
        <feature type="DMA"           n="14"     />        
        <feature type="NVIC"          n="54"     />        
        <feature type="TempSens"      n="1"     />        
        <feature type="Temp"          n="-40"     m="80"/>
        <feature type="VCC"           n="2.9"    m="3.60"/>
        <feature type="BGA"           n="96"/>
        <compile header="ADuCM320i\common\ADuCM320i.h"  define="ADuCM320i"/>
      </device> 
      <device Dname="ADuCM322">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <book    name="Documentation\DUI0552A_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>

        <debug      svd="SVD\ADuCM322.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="1"   default="1"/>
        <algorithm  name="Flash\ADUCM320.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x20000000"  RAMsize="0x0800"  default="1"/>
        <book    name="Documentation\ADuCM322\User Guide\UG-868.pdf"          title="ADuCM322 Hardware Reference Manual"/>
        <book    name="Documentation\ADuCM322\Datasheet\ADuCM322.pdf"                   title="ADuCM322 Data Sheet"/>
        <book    name="Documentation\Technotes\AN-806.pdf"          title="Flash Programming via I2C—Protocol Type 5"/>
        <book    name="Documentation\Technotes\AN-1310.pdf"         title="ADuCM320 Flash Programming via MDIO"/>
        <book    name="Documentation\Technotes\AN-1322.pdf"         title="ADuCM320 Code Execution Speed"/>
        <description>
The ADuCM322 is a Precision Analog Microcontroller, 14-Bit Analog I/O with MDIO interface, ARM Cortex M3
Typical applications include Optical networking – 10G, 40G and 100G modules, Industrial control and automation systems,
Smart sensors, precision instrumentation and Base station systems.
        </description>
        <feature type="ADC"           n="16"      m="14"    name="Multichannel, 14-bit 1MSPS ADC"/>
        <feature type="DAC"           n="8"       m="12"/>
        <feature type="Other"         n="1"       name="MDIO slave up to 4 MHz"/>
        <feature type="PLL"           n="1"       name="80 MHz PLL with programmable divider"/>
        <feature type="IntRC"         n="16000000" m="16000000"      name="Internal oscillator with +/-3% accuracy"/>
        <feature type="XTAL"          n="16000000" m="16000000"      name="External Crystal Oscillator"/>
        <feature type="Memory"        n="262144"  name="256kB Flash memory"/>
        <feature type="Memory"        n="32768"   name="8kB SRAM"/>
        <feature type="SPI"           n="2"       m="40000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="PWM"           n="6"       m="16"/>
        <feature type="UART"          n="1"       m="500000"/>
        <feature type="IOs"           n="40"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="WDT"           n="1"       name="16 bit Watchdog timer"/>
        <feature type="TimerOther"    n="1"       name="32 bit Wake-up timer"/>
        <feature type="DMA"           n="14"     />        
        <feature type="NVIC"          n="54"     />        
        <feature type="TempSens"      n="1"     />        
        <feature type="Temp"          n="-40"     m="80"/>
        <feature type="VCC"           n="2.9"    m="3.60"/>
        <feature type="BGA"           n="96"/>
        <compile header="ADuCM322\common\ADuCM322.h"  define="ADuCM322"/>
      </device>  
