glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM320_DFP.pdsc
      <device Dname="ADuCM322i">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <book    name="Documentation\DUI0552A_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>

        <debug      svd="SVD\ADuCM322.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="1"   default="1"/>
        <algorithm  name="Flash\ADUCM320.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x20000000"  RAMsize="0x0800"  default="1"/>
        <book    name="Documentation\ADuCM322\User Guide\UG-868.pdf"          title="ADuCM320 Hardware Reference Manual"/>
        <book    name="Documentation\ADuCM322\Datasheet\ADuCM322.pdf"                   title="ADuCM322 Data Sheet"/>
        <book    name="Documentation\Technotes\AN-1310.pdf"         title="ADuCM320 Flash Programming via MDIO"/>
        <book    name="Documentation\Technotes\AN-1322.pdf"         title="ADuCM320 Code Execution Speed"/>
        <description>
The ADuCM322i is a Precision Analog Microcontroller, 14-Bit Analog I/O with MDIO interface, ARM Cortex M3
Typical applications include Optical networking – 10G, 40G and 100G modules, Industrial control and automation systems,
Smart sensors, precision instrumentation and Base station systems.
        </description>
        <feature type="ADC"           n="16"      m="14"    name="Multichannel, 14-bit 1MSPS ADC"/>
        <feature type="DAC"           n="8"       m="12"/>
        <feature type="Other"         n="1"       name="MDIO slave up to 4 MHz"/>
        <feature type="PLL"           n="1"       name="80 MHz PLL with programmable divider"/>
        <feature type="IntRC"         n="16000000" m="16000000"      name="Internal oscillator with +/-3% accuracy"/>
        <feature type="XTAL"          n="16000000" m="16000000"      name="External Crystal Oscillator"/>
        <feature type="Memory"        n="262144"  name="256kB Flash memory"/>
        <feature type="Memory"        n="32768"   name="8kB SRAM"/>
        <feature type="SPI"           n="2"       m="40000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="PWM"           n="6"       m="16"/>
        <feature type="UART"          n="1"       m="500000"/>
        <feature type="IOs"           n="40"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="WDT"           n="1"       name="16 bit Watchdog timer"/>
        <feature type="TimerOther"    n="1"       name="32 bit Wake-up timer"/>
        <feature type="DMA"           n="14"     />        
        <feature type="NVIC"          n="54"     />        
        <feature type="TempSens"      n="1"     />        
        <feature type="Temp"          n="-40"     m="80"/>
        <feature type="VCC"           n="2.9"    m="3.60"/>
        <feature type="BGA"           n="96"/>
        <compile header="ADuCM322\common\ADuCM322.h"  define="ADuCM322"/>
      </device>      
      
    </family>
  </devices>

  <!-- boards section (mandatory for Board Support Packs) -->
   <boards>
      <board vendor="Analog Devices" name="EVAL-ADuCM320EBZ" revision="Rev. D" orderForm="http://www.analog.com/en/evaluation/eval-aducm320/eb.html">
      <description>Analog Devices ADuCM320 Evaluation Kit</description>
      <image small="Images\EVAL-ADuCM320EBZ_small.jpg" large="Images\EVAL-ADuCM320EBZ.jpg"/>
      <book category="setup"         name="Documentation\ADuCM320\User Guide\UG-692.pdf" title="Get Started Guide"/>
      <book category="schematic"     name="Documentation\ADuCM320\Evaluation Board\EVAL-ADuCM320EBZ RevD LAYERS.pdf"   title="Layout"/>
      <book category="schematic"     name="Documentation\ADuCM320\Evaluation Board\EVAL-ADuCM320EBZ RevD SCH.pdf"      title="Schematic"/>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM320"/>
      <debugInterface adapter="J-Link Lite ADI" connector="Mini-USB"/>
      <feature type="PWR"       n="4" m="5.5"      name="POWER Connector J1 for external supply"/>
      <feature type="PWR"       n="2.5"            name="POWER Connector J11 for external supply"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="USB"       n="1"              name="Mini-USB connector for UART"/>
      <feature type="RS232"     n="1"              name="TTL level UART connector"/>      
      <feature type="DIO"       n="29"             />
      <feature type="AIO"       n="16"             name="Analog inputs to ADC"/>
      <feature type="AIO"       n="8"              name="VDAC Outputs"/>
      <feature type="AIO"       n="4"              name="IDAC Outputs"/>
      <feature type="Button"    n="3"              name="Push-Buttons: external IRQ, Reset and Serial download"/>
      <feature type="LED"       n="1"              name="User LED"/>
      </board>
      
      <board vendor="Analog Devices" name="EVAL-ADuCM320iQSPZ" revision="Rev. A" orderForm="http://www.analog.com/en/evaluation/eval-aducm320/eb.html">
      <description>Analog Devices ADuCM320i Evaluation Kit</description>
      <image small="Images\EVAL-ADuCM320iQSPZ_small.jpg" large="Images\EVAL-ADuCM320iQSPZ.jpg"/>
      <book category="setup"         name="Documentation\ADuCM320i\User Guide\UG-692.pdf" title="Get Started Guide"/>
      <book category="schematic"     name="Documentation\ADuCM320i\Evaluation Board\EVAL-ADuCM320iQSPZ RevA LAYERS.pdf"   title="Layout"/>
      <book category="schematic"     name="Documentation\ADuCM320i\Evaluation Board\EVAL-ADuCM320iQSPZ RevA SCH.pdf"      title="Schematic"/>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM320i"/>
      <debugInterface adapter="J-Link Lite ADI" connector="Mini-USB"/>
      <feature type="PWR"       n="4" m="5.5"      name="POWER Connector J1 for external supply"/>
      <feature type="PWR"       n="2.5"            name="POWER Connector J11 for external supply"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="USB"       n="1"              name="Mini-USB connector for UART"/>
      <feature type="RS232"     n="1"              name="TTL level UART connector"/>      
      <feature type="DIO"       n="29"             />
      <feature type="AIO"       n="16"             name="Analog inputs to ADC"/>
      <feature type="AIO"       n="8"              name="VDAC Outputs"/>
      <feature type="AIO"       n="4"              name="IDAC Outputs"/>
      <feature type="Button"    n="3"              name="Push-Buttons: external IRQ, Reset and Serial download"/>
      <feature type="LED"       n="1"              name="User LED"/>
      </board>
            
      <board vendor="Analog Devices" name="EVAL-ADuCM322EBZ" revision="Rev. A" orderForm="http://www.analog.com/en/evaluation/eval-aducm322/eb.html">
      <description>Analog Devices ADuCM322 Evaluation Kit</description>
      <image small="Images\EVAL-ADuCM322EBZ_small.jpg" large="Images\EVAL-ADuCM322EBZ.jpg"/>
      <book category="setup"         name="Documentation\ADuCM322\Evaluation Board\UG-910.pdf" title="Get Started Guide"/>
      <book category="schematic"     name="Documentation\ADuCM322\Evaluation Board\EVAL-ADuCM322EBZ RevA LAYERS.pdf"   title="Layout"/>
      <book category="schematic"     name="Documentation\ADuCM322\Evaluation Board\EVAL-ADuCM322EBZ RevA SCH.pdf"      title="Schematic"/>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM322"/>
      <debugInterface adapter="J-Link Lite ADI" connector="Mini-USB"/>
      <feature type="PWR"       n="5" m="5.5"      name="POWER Connector J5 for external supply"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="USB"       n="1"              name="Mini-USB connector for UART"/>
      <feature type="RS232"     n="1"              name="TTL level UART connector"/>      
      <feature type="DIO"       n="29"             />
      <feature type="AIO"       n="16"             name="Analog inputs to ADC"/>
      <feature type="AIO"       n="8"              name="VDAC Outputs"/>
      <feature type="Button"    n="3"              name="Push-Buttons: external IRQ, Reset and Serial download"/>
      <feature type="LED"       n="1"              name="User LED"/>
      </board>
   </boards>
   <!-- examples section (optional for all Software Packs)-->

   <examples>
    <example name="ADC" doc="Abstract.txt" folder="ADuCM322\examples\ADC">
      <description>ADC example</description> 
      <board name="EVAL-ADuCM322EBZ" vendor="Analog Devices" /> 
      <project>
        <environment name="uv" load="ADC.uvprojx" /> 
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" /> 
        <component Cclass="Device" Cgroup="Startup" /> 
        <category>Getting Started</category> 
      </attributes>
    </example>
    
