glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM320_DFP.pdsc
  </examples>
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
   <conditions>
      <condition id="ADuCM320">
         <description>ADuCM320 device</description>
         <require Dvendor="Analog Devices:1"/>
         <require Dname="ADuCM320"/>
      </condition>
    <condition id="ADuCM320 CMSIS Device">
      <description>ADuCM320 CMSIS Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require condition="ADuCM320"/>
    </condition>
    <condition id="ADuCM320 Library">
      <description>Low Level Peripheral Libraries for ADuCM320</description>
      <require condition="ADuCM320"/>
    </condition>
    <condition id="ADuCM320i">
      <description>ADuCM320i device</description>
      <require Dvendor="Analog Devices:1"/>
      <require Dname="ADuCM320i"/>
    </condition>
    <condition id="ADuCM320i CMSIS Device">
      <description>ADuCM320i CMSIS Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require condition="ADuCM320i"/>
    </condition>
    <condition id="ADuCM320i Library">
      <description>Low Level Peripheral Libraries for ADuCM320i</description>
      <require condition="ADuCM320i"/>
    </condition>
    <condition id="ADuCM322">
      <description>ADuCM322 device</description>
      <require Dvendor="Analog Devices:1"/>
      <require Dname="ADuCM322"/>
    </condition>
    <condition id="ADuCM322 CMSIS Device">
      <description>ADuCM322 CMSIS Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require condition="ADuCM322"/>
    </condition>
    <condition id="ADuCM322 Library">
      <description>Low Level Peripheral Libraries for ADuCM322</description>
      <accept condition="ADuCM322"/>
      <accept condition="ADuCM322i"/>
    </condition>
    <condition id="ADuCM322i">
      <description>ADuCM322i device</description>
      <require Dvendor="Analog Devices:1"/>
      <require Dname="ADuCM322i"/>
    </condition>
    <condition id="ADuCM322i CMSIS Device">
      <description>ADuCM322i CMSIS Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require condition="ADuCM322i"/>
    </condition>
    <condition id="ADuCM32x_ARM">
      <description>ADuCM32x device</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ADuCM32x_IAR">
      <description>ADuCM32x device</description>
      <require Tcompiler="IAR"/>
    </condition>
  </conditions> 
  
   <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" Cvendor="Analog Devices" condition="ADuCM320 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for ADuCM320</description>

      <files>
        <!-- additional include path -->
				<file category="include" name="ADuCM320\common\"/>

        <!-- startup files -->
        <file category="source" name="ADuCM320\common\ARM\startup_ADuCM320.s" version="0.3.0" attr="config" condition="ADuCM32x_ARM"/>
        <file category="source" name="ADuCM320\common\IAR\startup_ADuCM320.s" version="0.2.0" attr="config" condition="ADuCM32x_IAR"/>
        
        <!-- system files -->
        <file category="source" name="ADuCM320\common\system_ADUCM320.c" version="0.1.0" attr="config"  />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" Cvendor="Analog Devices" condition="ADuCM320i CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for ADuCM320i</description>

      <files>
        <!-- additional include path -->
				<file category="include" name="ADuCM320i\common\"/>

        <!-- startup files -->
        <file category="source" name="ADuCM320i\common\ARM\startup_ADuCM320i.s" version="0.1.0" attr="config" condition="ADuCM32x_ARM"/>
        <file category="source" name="ADuCM320i\common\IAR\startup_ADuCM320i.s" version="0.1.0" attr="config" condition="ADuCM32x_IAR"/>
        
        <!-- system files -->
        <file category="source" name="ADuCM320i\common\system_ADUCM320I.c" version="0.1.0" attr="config"  />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" Cvendor="Analog Devices" condition="ADuCM322 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for ADuCM322</description>

      <files>
        <!-- additional include path -->
				<file category="include" name="ADuCM322\common\"/>

        <!-- startup files -->
        <file category="source" name="ADuCM322\common\ARM\startup_ADuCM322.s" version="0.1.0" attr="config" condition="ADuCM32x_ARM"/>
        <file category="source" name="ADuCM322\common\IAR\startup_ADuCM322.s" version="0.1.0" attr="config" condition="ADuCM32x_IAR"/>
        
        <!-- system files -->
        <file category="source" name="ADuCM322\common\system_ADUCM322.c" version="0.1.0" attr="config"  />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" Cvendor="Analog Devices" condition="ADuCM322i CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for ADuCM322i</description>

      <files>
        <!-- additional include path -->
				<file category="include" name="ADuCM322\common\"/>

        <!-- startup files -->
        <file category="source" name="ADuCM322\common\ARM\startup_ADuCM322.s" version="0.1.0" attr="config" condition="ADuCM32x_ARM"/>
        <file category="source" name="ADuCM322\common\IAR\startup_ADuCM322.s" version="0.1.0" attr="config" condition="ADuCM32x_IAR"/>
        
        <!-- system files -->
        <file category="source" name="ADuCM322\common\system_ADUCM322.c" version="0.1.0" attr="config"  />
      </files>
    </component>
    
      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="ADC" Cversion="1.0.0" condition="ADuCM320 Library">
         <description>ADC low level library for ADuCM320</description>
         <files>
            <file category="header" attr="config" name="ADuCM320\common\AdcLib.h" version="1.0.2"/>
            <file category="source" attr="config" name="ADuCM320\common\AdcLib.c" version="1.0.2"/>
         </files>
      </component>
